{
  "common": {
    "name": "rpi2",
    "version": "2.4.0",
    "news": {
      "2.4.0": {
        "en": "read the current state of GPIO outputs during adapter startup.\nre-read GPIO input, if set by the user (with ack=false).\nadd an option to invert true/false mapping to 1/0.\nAllow multiple instances of this adapter per host.\ntried to improve initialization of GPIO inputs.",
        "de": "lesen des aktuellen Zustands der GPIO-Ausgänge beim Adapter-Start.\ngPIO-Eingänge erneut lesen, wenn vom Benutzer versehentlich gesteuert (mit ack=false).\nEine option hinzugefügt zur Invertierung von true/false mapping auf 1/0.\nMehrere Instanzen dieses Adapters pro Host erlaubt.\nVersucht, die Initialisierung der GPIO-Eingänge zu verbessern.",
        "ru": "ознакомьтесь с текущим состоянием выводов GPIO во время запуска адаптера.\nперечитайте ввод GPIO, если он установлен пользователем (с ack=false).\nдобавить опцию инвертировать истинное/ложное отображение до 1/0.\nРазрешить несколько экземпляров этого адаптера на хост.\nпытался улучшить инициализацию входов GPIO.",
        "pt": "leia o estado atual de saídas GPIO durante a inicialização do adaptador.\nre-leia entrada GPIO, se definido pelo usuário (com ack=false).\nadicionar uma opção para inverter mapeamento verdadeiro / falso para 1/0.\nPermitir várias instâncias deste adaptador por host.\ntentou melhorar a inicialização de entradas GPIO.",
        "nl": "lees de huidige staat van GPIO-uitgangen tijdens het opstarten van de adapter.\nherlees GPIO-invoer, indien ingesteld door de gebruiker (met ack=false).\nvoeg een optie toe om true/false mapping om te keren naar 1/0.\nMeerdere instanties van deze adapter per host toestaan.\ngeprobeerd om de initialisatie van GPIO ingangen te verbeteren.",
        "fr": "lire l'état actuel des sorties GPIO lors du démarrage de l'adaptateur.\nrelire l'entrée GPIO, si définie par l'utilisateur (avec ack=false).\najouter une option pour inverser true/false mapping au 1/0.\nAutoriser plusieurs instances de cet adaptateur par hôte.\na essayé d'améliorer l'initialisation des entrées GPIO.",
        "it": "leggere lo stato attuale delle uscite GPIO durante l'avvio dell'adattatore.\nre-read GPIO input, se impostato dall'utente (con ack=false).\naggiungere un'opzione per invertire la mappatura vera/falsa a 1/0.\nConsentire più istanze di questo adattatore per host.\nha cercato di migliorare l'inizializzazione degli ingressi GPIO.",
        "es": "leer el estado actual de salidas GPIO durante la puesta en marcha del adaptador.\nvolver a leer la entrada GPIO, si se establece por el usuario (con ack=false).\nañadir una opción para invertir la cartografía verdadera/falsa a 1/0.\nPermitir múltiples instancias de este adaptador por host.\ntrató de mejorar la inicialización de los insumos de GPIO.",
        "pl": "czytaj aktualny stan wyjść GPIO podczas uruchamiania adaptera.\nre- read GPIO input, if set by the user (with ack = false).\ndodaj opcję, aby odwrócić prawdziwe / fałszywe odwzorowanie do 1 / 0.\nZezwala na wiele instancji tego adaptera na hosta.\npróbował poprawić inicjalizację wejść GPIO.",
        "uk": "читати поточний стан виходів GPIO під час запуску адаптера.\nперечитати вхід GPIO, якщо встановити користувачем (з ack=false).\nдодати варіант для інвертації true/false до 1/0.\nДозволити кілька екземплярів цього адаптера за господар.\nнамагалася вдосконалити ініціалізацію вводів GPIO.",
        "zh-cn": "读取适配器启动期间GPIO输出的当前状态.\n重读 GPIO 输入,如果由用户设置(带有 ack=false).\n将反向真实/假映射的选项添加到 1/0.\n每个主机允许此适配器的多个实例 .\n尝试改进GPIO投入的初始化."
      },
      "2.3.2": {
        "en": "added support for NVMe temperature (needs additional configuration, see README)\nfixed inital values for outputs.",
        "de": "Unterstützung für NVMe-Temperatur (benötigt zusätzliche Konfiguration, siehe README) hinzugefügt\nInitalwerte für Ausgänge repariert.",
        "ru": "дополнительная поддержка температуры NVMe (необходимая дополнительная конфигурация, см. README)\nфиксированные первоначальные значения для результатов.",
        "pt": "suporte adicionado para a temperatura NVMe (necessita configuração adicional, veja README)\nvalores inital fixos para saídas.",
        "nl": "extra ondersteuning voor NVMe temperatuur (nodige extra configuratie, zie README)\nvaste initale waarden voor outputs.",
        "fr": "prise en charge supplémentaire de la température NVMe (besoins de configuration supplémentaire, voir README)\nvaleurs initales fixes pour les sorties.",
        "it": "supporto aggiunto per la temperatura NVMe (necessità di configurazione aggiuntiva, vedi README)\nvalori fissi inital per uscite.",
        "es": "soporte añadido para temperatura NVMe (necesita configuración adicional, véase README)\nvalores initales fijos para salidas.",
        "pl": "dodane wsparcie dla temperatury NVMe (wymaga dodatkowej konfiguracji, patrz README)\nstałe wartości wewnętrzne dla wyjść.",
        "uk": "додана підтримка температури NVMe (при додатковій конфігурації див. README)\nфіксовані значення для виходу.",
        "zh-cn": "添加对 NVMe 温度的支持( 需要额外的配置, 请参见 README)\n产出的固定实值."
      },
      "2.3.1": {
        "en": "fixed: GPIO library failed to load after recent dependency update.",
        "de": "behoben: Die GPIO-Bibliothek konnte nach dem aktuellen Abhängigkeitsupdate nicht geladen werden.",
        "ru": "фиксированный: библиотека GPIO не загрузилась после недавнего обновления зависимости.",
        "pt": "corrigido: Biblioteca GPIO não conseguiu carregar após atualização recente de dependência.",
        "nl": "vast: GPIO-bibliotheek kon niet worden geladen na recente afhankelijkheidsupdate.",
        "fr": "corrigé : la bibliothèque GPIO n'a pas réussi à se charger après la mise à jour récente de la dépendance.",
        "it": "fisso: la libreria GPIO non è riuscita a caricare dopo il recente aggiornamento della dipendenza.",
        "es": "fijo: la biblioteca GPIO no se carga después de la actualización reciente de dependencia.",
        "pl": "stałe: biblioteka GPIO nie wczytała się po ostatniej aktualizacji zależności.",
        "uk": "виправлено: Бібліотека GPIO не вдалося завантажити після останнього оновлення залежності.",
        "zh-cn": "固定: GPIO 库在最近依赖更新后无法加载 ."
      },
      "2.3.0": {
        "en": "correct interpretation of start value setting. Output with initial value 0/1 will set GPIO accordingly during startup. Output without an initial state will not set GPIO at all.",
        "de": "Interpretation der Startwerteinstellung korrigiert. Ausgang mit dem Anfangswert 0/1 setzt den GPIO beim Start entsprechend. Ausgang ohne Ausgangszustand wird GPIO beim Starten überhaupt nicht setzen.",
        "ru": "правильная интерпретация стартового значения. Выход с первоначальным значением 0/1 установит GPIO соответственно во время запуска. Выход без начального состояния не будет устанавливать GPIO вообще.",
        "pt": "interpretação correta da definição de valor inicial. A saída com valor inicial 0/1 definirá GPIO de acordo durante a inicialização. A saída sem um estado inicial não vai definir GPIO em absoluto.",
        "nl": "correcte interpretatie van de instelling van de startwaarde. Uitvoer met initiële waarde 0/1 zal GPIO dienovereenkomstig instellen tijdens het opstarten. Uitvoer zonder begintoestand zal GPIO helemaal niet instellen.",
        "fr": "interprétation correcte de la valeur de début. La sortie avec la valeur initiale 0/1 définira GPIO en conséquence lors du démarrage. La sortie sans état initial ne définira pas GPIO du tout.",
        "it": "corretta interpretazione dell'impostazione del valore di inizio. L'uscita con valore iniziale 0/1 imposta GPIO di conseguenza durante l'avvio. L'uscita senza uno stato iniziale non imposta affatto GPIO.",
        "es": "correcta interpretación de la configuración del valor inicial. La salida con valor inicial 0/1 establecerá GPIO en consecuencia durante la puesta en marcha. La salida sin un estado inicial no establecerá GPIO en absoluto.",
        "pl": "poprawna interpretacja ustawienia wartości początkowej. Wyjście o wartości początkowej 0 / 1 ustawi odpowiednio GPIO podczas uruchamiania. Wyjście bez stanu początkowego w ogóle nie ustawi GPIO.",
        "uk": "правильне тлумачення параметра початкового значення. Вихід з початковою вартістю 0/1 буде встановлювати GPIO відповідно під час запуску. Вихід без початкового стану не буде встановлювати GPIO на всіх.",
        "zh-cn": "对起始值设置的正确解释。 初始值0/1的产出将在启动期间相应设置GPIO. 没有初始状态的输出将根本不设置 GPIO ."
      },
      "2.2.2": {
        "en": "responsive design for settings page added",
        "de": "responsive design für einstellungsseite hinzugefügt",
        "ru": "адаптивный дизайн для настроек добавлена страница",
        "pt": "design responsivo para configurações página adicionada",
        "nl": "responsief ontwerp voor instellingen pagina toegevoegd",
        "fr": "conception réactive pour les paramètres page ajoutée",
        "it": "design reattivo per le impostazioni pagina aggiunto",
        "es": "diseño sensible para la página de configuración añadido",
        "pl": "responsive design for settings page added",
        "uk": "адаптивний дизайн для сторінки налаштувань",
        "zh-cn": "添加了设置的响应性设计"
      },
      "2.2.1": {
        "en": "temperature has now proper role and type.",
        "de": "temperatur hat jetzt richtige rolle und typ.",
        "ru": "температура теперь имеет надлежащую роль и тип.",
        "pt": "temperatura tem agora o papel e tipo adequados.",
        "nl": "de temperatuur heeft nu de juiste rol en type.",
        "fr": "la température a maintenant un rôle et un type appropriés.",
        "it": "la temperatura ha ora un ruolo e un tipo adeguato.",
        "es": "la temperatura tiene ahora el papel y el tipo adecuados.",
        "pl": "temperatura ma teraz właściwą rolę i typ.",
        "uk": "температура тепер має належну роль і тип.",
        "zh-cn": "温度现在有合适的角色和类型."
      },
      "2.2.0": {
        "en": "rebuild config in JSONConfig.",
        "de": "Umbau der config auf JSONConfig.",
        "ru": "восстановить конфигурацию в JSONConfig.",
        "pt": "reconstruir a configuração em JSONConfig.",
        "nl": "config opnieuw opbouwen in JSONConfig.",
        "fr": "reconstruire la configuration de JSONConfig.",
        "it": "ricostruire la configurazione in JSONConfig.",
        "es": "reconstruir config en JSONConfig.",
        "pl": "odbudowa konfiguracji w JSONConfig.",
        "uk": "rebuild config в JSONConfig.",
        "zh-cn": "在 JSONConfig 中重建配置."
      }
    },
    "titleLang": {
      "en": "RPI Monitor and GPIO",
      "de": "RPI-Monitor und GPIO",
      "ru": "Монитор RPI и GPIO",
      "pt": "Monitor RPI e GPIO",
      "nl": "RPI-monitor en GPIO",
      "fr": "Moniteur RPI et GPIO",
      "it": "Monitoraggio RPI e GPIO",
      "es": "Monitor RPI y GPIO",
      "pl": "Monitor RPI i GPIO",
      "uk": "Монітор RPI та GPIO",
      "zh-cn": "RPI 监视器和 GPIO"
    },
    "desc": {
      "en": "Monitor data from a Raspberry PI and interact with GPIOs.",
      "de": "Überwachen Sie Daten von einem Raspberry PI und interagieren Sie mit GPIOs.",
      "ru": "Отслеживайте данные Raspberry PI и взаимодействуйте с GPIO.",
      "pt": "Monitore dados de um Raspberry PI e interaja com GPIOs.",
      "nl": "Bewaak gegevens van een Raspberry PI en communiceer met GPIO's.",
      "fr": "Surveillez les données d'un Raspberry PI et interagissez avec les GPIO.",
      "it": "Monitora i dati da un Raspberry PI e interagisci con i GPIO.",
      "es": "Supervise los datos de una Raspberry PI e interactúe con GPIO.",
      "pl": "Monitoruj dane z Raspberry PI i korzystaj z GPIO.",
      "uk": "Відстежуйте дані з Raspberry PI та взаємодійте з GPIO.",
      "zh-cn": "监控来自 Raspberry PI 的数据并与 GPIO 交互。"
    },
    "authors": [
      "Christian Baumgartner",
      "husky-koglhof <husky.koglhof@icloud.com>",
      "Garfonso <garfonso@mobo.info>"
    ],
    "os": [
      "linux"
    ],
    "keywords": [
      "raspberry",
      "monitoring",
      "gpio",
      "raspian"
    ],
    "licenseInformation": {
      "type": "free",
      "license": "MIT"
    },
    "platform": "Javascript/Node.js",
    "icon": "rpi2.png",
    "enabled": true,
    "extIcon": "https://raw.githubusercontent.com/iobroker-community-adapters/ioBroker.rpi2/master/admin/rpi2.png",
    "readme": "https://github.com/iobroker-community-adapters/ioBroker.rpi2/blob/master/README.md",
    "loglevel": "info",
    "tier": 2,
    "mode": "daemon",
    "type": "hardware",
    "compact": true,
    "connectionType": "local",
    "dataSource": "poll",
    "adminUI": {
      "config": "json"
    },
    "osDependencies": {
      "linux": [
        "build-essential",
        "python",
        "libgpiod-dev"
      ]
    },
    "dependencies": [
      {
        "js-controller": ">=6.0.11"
      }
    ],
    "globalDependencies": [
      {
        "admin": ">=7.4.10"
      }
    ],
    "messages": [
      {
        "condition": {
          "operand": "and",
          "rules": [
            "oldVersion<2.0.0",
            "newVersion>=2.0.0"
          ]
        },
        "title": {
          "en": "GPIO Breaking Change",
          "de": "GPIO Veränderung",
          "ru": "GPIO Перерывы",
          "pt": "GPIO Mudança de ruptura",
          "nl": "GPIO Verandering doorbreken",
          "fr": "GPIO Briser le changement",
          "it": "GPIO Cambiamento di rottura",
          "es": "GPIO Cambio de ruptura",
          "pl": "GPIO Łamanie zmian",
          "uk": "ГРУП Зміна несправностей",
          "zh-cn": "科普罗 中断更改"
        },
        "text": {
          "en": "GPIO needed massive changes for support of newer Raspian versions (Bookworm and following). Please check your GPIO configuration and if everything still works. GPIO Button support is removed. If you need it, please discuss in Github, see link. - Also, keep in mind that hardware pull up / down is still not supported.",
          "de": "GPIO brauchte massive Änderungen für die Unterstützung neuerer Raspian Versionen (Bookworm und nachfolgend). Bitte überprüfen Sie Ihre GPIO-Konfiguration und wenn alles noch funktioniert. GPIO Button-Unterstützung wird entfernt. Wenn Sie es brauchen, diskutieren Sie bitte in Github, siehe Link.",
          "ru": "GPIO нуждались в массовых изменениях для поддержки более новых версий Raspian (Bookworm и следующий). Пожалуйста, проверьте конфигурацию GPIO и все ли еще работает. Поддержка GPIO Button удалена. Если вам это нужно, пожалуйста, обсудите в Гитубе, см. ссылку.",
          "pt": "O GPIO precisava de mudanças massivas para o suporte de versões mais recentes do Raspian (Bookworm e seguintes). Por favor, verifique sua configuração GPIO e se tudo ainda funciona. O suporte do botão GPIO é removido. Se precisar, por favor, discuta no Github, veja link.",
          "nl": "GPIO had massale veranderingen nodig voor ondersteuning van nieuwere Raspian versies (Bookworm en volgende). Controleer uw GPIO configuratie en of alles nog werkt. GPIO-knop ondersteuning is verwijderd. Als je het nodig hebt, bespreek het dan in Github, zie link.",
          "fr": "GPIO a besoin de changements massifs pour soutenir les nouvelles versions Raspiennes (Bookworm et suivants). Veuillez vérifier votre configuration GPIO et si tout fonctionne encore. Le support du bouton GPIO est enlevé. Si vous en avez besoin, veuillez discuter à Github, voir le lien.",
          "it": "GPIO aveva bisogno di enormi cambiamenti per il supporto delle nuove versioni Raspian (Bookworm e seguenti). Controllare la configurazione GPIO e se tutto funziona ancora. Il supporto del pulsante GPIO viene rimosso. Se avete bisogno, si prega di discutere a Github, vedere il link.",
          "es": "GPIO necesitaba cambios masivos para apoyar las nuevas versiones de Raspian (worm y siguientes). Por favor, compruebe su configuración de GPIO y si todo sigue funcionando. GPIO Button support is removed. Si lo necesita, por favor discuta en Github, vea el enlace.",
          "pl": "GPIO potrzebowało ogromnych zmian dla wsparcia nowszych wersji Raspian (Bookworm i następnie). Proszę sprawdzić konfigurację GPIO i czy wszystko nadal działa. Wsparcie GPIO Button jest usuwane. W razie potrzeby proszę omówić to w Github, zobacz link.",
          "uk": "GPIO вимагає масивних змін для підтримки нових версій Raspian (Bookworm і наступні). Будь ласка, перевірте налаштування GPIO і якщо все ще працює. При видаленні кнопки GPIO. Якщо вам потрібно, будь ласка, покажіть в Github, див. посилання.",
          "zh-cn": "GPIO需要大规模修改来支持较新的Raspian版本(Bookdorm and follows). 请检查您的 GPIO 配置, 如果一切都还在工作。 GPIO按钮支持被删除. 如果你需要,请在Github讨论,参见链接."
        },
        "link": "https://github.com/iobroker-community-adapters/ioBroker.rpi2/issues/192",
        "level": "warn",
        "linkText": {
          "en": "GPIO Button discussion.",
          "de": "GPIO Button Diskussion.",
          "ru": "GPIO Button discussion.",
          "pt": "Discussão do botão GPIO.",
          "nl": "GPIO Button discussie.",
          "fr": "Discussion sur le bouton GPIO.",
          "it": "GPIO Button discussione.",
          "es": "GPIO Button discussion.",
          "pl": "Dyskusja GPIO Button.",
          "uk": "Обговорення кнопки GPIO.",
          "zh-cn": "GPIO按钮讨论."
        },
        "buttons": [
          "agree",
          "cancel"
        ]
      }
    ]
  },
  "native": {
    "c_cpu": true,
    "c_raspberry": false,
    "c_memory": true,
    "c_network": true,
    "c_sdcard": true,
    "c_swap": true,
    "c_temperature": true,
    "c_uptime": true,
    "c_wlan": true,
    "interval": 60000,
    "gpioSettings": []
  },
  "objects": [],
  "instanceObjects": []
}
